from typing import Any, Dict, List

import pytest


@pytest.fixture
def test_transactions() -> List[Dict[str, Any]]:
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.89,
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
        {
            "Дата операции": "31.12.2021 16:42:04",
            "Дата платежа": 0,
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Кэшбэк": 70,
            "Категория": "Ж/д билеты",
            "Описание": "Колхоз",
        },
    ]
